import React, {Component} from 'react';

class TourIntro extends Component {
    render() {
        return (
            <div>
                <h3 className='display-6'>Το ταξιδι με μια ματια</h3>
                <p className='text-secondary'>Το πρόγραμμα-προπύργιο της «άλλης» Ευρώπης του Versus Travel. Ένα υπέροχο ταξίδι, σχεδιασμένο όπως πρέπει να είναι μια ολοκληρωμένη επίσκεψη σε μια περιοχή, με γεμάτες ημέρες, χωρίς προαιρετικές εκδρομές, με διαμονή σε ιστορικές πόλεις και έμφαση στην ιστορία και τον πολιτισμό. Από τους κοσμοπολίτικους προορισμούς Μόντε Κάρλο και Κάννες μέχρι τη Νιμ. Ένα ταξίδι-ορισμός του πληθωρικού, σχεδιασμένο ειδικά για τους ταξιδιώτες που ακόμα και στην Ευρώπη θέλουν τα ταξίδια τους «εξερευνητικά». Η διαμονή στην καρδιά της Νιμ, δίπλα στη Ρωμαϊκή Αρένα, η διαμονή στις Κάννες δίπλα στην Κρουαζέτ είναι επιπλέον στοιχεία ενός ευρηματικά προγραμματισμένου ταξιδιού, που ξεφεύγει από τις εύκολες λύσεις – διαμονή δηλαδή σε μια πόλη-κέντρο και από εκεί κουραστικές ημερήσιες εκδρομές και με τα πάντα προαιρετικά. Το πρόγραμμα-προπύργιο της «άλλης» Ευρώπης του Versus Travel. Ένα υπέροχο ταξίδι, σχεδιασμένο όπως πρέπει να είναι μια ολοκληρωμένη επίσκεψη σε μια περιοχή, με γεμάτες ημέρες, χωρίς προαιρετικές εκδρομές, με διαμονή σε ιστορικές πόλεις και έμφαση στην ιστορία και τον πολιτισμό. Από τους κοσμοπολίτικους προορισμούς Μόντε Κάρλο και Κάννες μέχρι τη Νιμ. Ένα ταξίδι-ορισμός του πληθωρικού, σχεδιασμένο ειδικά για τους ταξιδιώτες που ακόμα και στην Ευρώπη θέλουν τα ταξίδια τους «εξερευνητικά».</p>
            </div>
        );
    }
}

export default TourIntro;