import React, {Component} from 'react';
import {FaCheck} from "react-icons/fa";

class TourIncluded extends Component {
    render() {
        return (
            <div className="d-flex mt-4">
                <ul className='tour-included pl-3 col-6'>
                    <li><FaCheck /> Πτήσεις με KLM</li>
                    <li><FaCheck /> Ξενοδοχεία 4* και 5* ως ακολούθως ή παρόμοια</li>
                    <li><FaCheck /> Ξενάγηση της Λίμα και επίσκεψη στο Παγκοσμίως διάσημο Μουσείο του Χρυσού</li>
                    <li><FaCheck /> Μοναδικό πρόγραμμα με επίσκεψη στο Μουσείο Λάρκο Ερέρα με μια συλλογή που υπερβαίνει τα 45.000 αντικείμενα προϊνκαϊκών πολιτισμών και δείπνο στο εστιατόριο του μουσείου!</li>
                    <li><FaCheck /> Κρουαζιέρα στον υδροβιότοπο των Iσλας Mπαγιέστας</li>
                    <li><FaCheck /> Διανυκτέρευση στη Νάσκα και πτήση με ελαφρά αεροπλάνα πάνω από τις μυστηριώδεις γραμμές της</li>
                    <li><FaCheck /> Δυο διανυκτερεύσεις στην Αρεκίπα, γνωστή ως «Λευκή Πόλη», δεύτερη σε μέγεθος πόλη της χώρας με ξενάγηση</li>
                    <li><FaCheck /> Βαρκάδα στη λίμνη Τιτικάκα, όπου θα επισκεφθούμε τα μοναδικά «πλωτά νησιά» που είναι φτιαγμένα από καλάμια και που κατοικούνται εδώ και αιώνες από τους Ούρος</li>

                </ul>
                <ul className='tour-included pl-3 col-6'>
                    <li><FaCheck /> Βαρκάδα στη λίμνη Τιτικάκα, όπου θα επισκεφθούμε τα μοναδικά «πλωτά νησιά» που είναι φτιαγμένα από καλάμια και που κατοικούνται εδώ και αιώνες από τους Ούρος</li>
                    <li><FaCheck /> Δύο (2) διανυκτερεύσεις στο Πούνο με μεστή ξενάγηση της πόλης και ξενάγηση στα Τσούλπας Σιλουστάνι</li>
                    <li><FaCheck /> Επίσκεψη στο Ράτσι, έναν ινκαϊκό αρχαιολογικό χώρο στον οποίο ξεχωρίζει ο ναός του θεού των Ίνκας, Βαϊρακότσα</li>
                    <li><FaCheck /> Θα επισκεφθούμε το Ολιανταϋτάμπο, χωριό μεγάλης στρατηγικής σημασίας τόσο για τους Ίνκας, όσο και για τους Ισπανούς και τη παραδοσιακή αγορά Τσίντσερο στο ομώνυμο χωριό</li>
                </ul>
            </div>
        );
    }
}

export default TourIncluded;