import React, {Component} from 'react';
import {Helmet} from "react-helmet";

class PointsOfInterest extends Component {

    constructor(props) {
        super(props);
        this.setActivePoint = this.setActivePoint.bind(this)

        this.state = {
            activePoint: 0,
            points: [
                {
                    name: 'Βερσαλλιες',
                    url: 'https://image.freepik.com/free-photo/view-palace-versailles-interiors_1268-3776.jpg',
                    text: 'Το κέντρο των Βερσαλλιών είναι η Αίθουσα των Καθρεφτών (ή και Αίθουσα των Κατόπτρων), μήκους 70 μέτρων και είναι στολισμένη με πανάκριβα κρύσταλλα, κεριά και καθρέφτες, τους πιο ακριβούς της εποχής εκείνης. Επίσης στην οροφή και στους τοίχους δεσπόζουν οι τοιχογραφίες και άλλα διάφορα έργα τέχνης από τους καλύτερους ζωγράφους της Ευρώπης εκείνης της εποχής, με ανεκτίμητη αξία. Παράλληλα, δίπλα στην Αίθουσα των Καθρεφτών βρίσκονται τα βασιλικά διαμερίσματα, με μεγαλύτερο αυτό του βασιλιά, που περιλαμβάνει δεκάδες δωμάτια. Κυρίαρχο στοιχείο σε όλα αυτά τα δωμάτια είναι οι τοιχογραφίες και οι πίνακες ζωγραφικής, εμπνευσμένοι από την ελληνική μυθολογία. Έτσι τα δωμάτια αυτά φέρουν τα ονόματα όπως Δωμάτιο του Ηρακλή, Σαλόνι της Αφροδίτης κτλ. Στο κέντρο της Αίθουσας των Κατόπτρων βρίσκεται η είσοδος για το πολυτελέστατο υπνοδωμάτιο του βασιλιά, με απερίγραπτο πλούτο. Συμβολίζει το κέντρο της δύναμης του απόλυτου μονάρχη, το κέντρο της χώρας υπό τον Λουδοβίκο ΙΔ\', που είναι ο θεμελιωτής των Βερσαλλιών. Το 1710 ήταν έτοιμη και η Βασιλική Εκκλησία, ενώ το 1770 και η Βασιλική Όπερα. Συνολικά στο παλάτι υπάρχουν 700 δωμάτια.[1] Πριν χτιστεί η Βασιλική εκκλησία του ανακτόρου, διάφοροι χώροι χρησίμευαν ως χώροι για εκκλησιαστική λειτουργία. Έχει δύο ορόφους, στον δεύτερο παρευρισκόταν ο βασιλιάς μαζί με την βασιλική οικογένεια ενώ στο ισόγειο οι ευγενείς της βασιλικής αυλής. Οι τοιχογραφίες σε όλη την εκκλησία έχουν ως κύριο θέμα το Άγιο Πνεύμα, τον Θεό και τον Χριστό.'
                },
                {
                    name: 'Λουβρο',
                    url: 'https://media.architecturaldigest.com/photos/585836f8001c874267ed3f29/master/w_3000,h_1757,c_limit/Louvre%20Pyramid%20AIA.jpg',
                    text: 'Το κέντροεςφν είναι η Αίθουσα των Καθρεφτών (ή και Αίθουσα των Κατόπτρων), μήκους 70 μέτρων και είναι στολισμένη με πανάκριβα κρύσταλλα, κεριά και καθρέφτες, τους πιο ακριβούς της εποχής εκείνης. Επίσης στην οροφή και στους τοίχους δεσπόζουν οι τοιχογραφίες και άλλα διάφορα έργα τέχνης από τους καλύτερους ζωγράφους της Ευρώπης εκείνης της εποχής, με ανεκτίμητη αξία. Παράλληλα, δίπλα στην Αίθουσα των Καθρεφτών βρίσκονται τα βασιλικά διαμερίσματα, με μεγαλύτερο αυτό του βασιλιά, που περιλαμβάνει δεκάδες δωμάτια. Κυρίαρχο στοιχείο σε όλα αυτά τα δωμάτια είναι οι τοιχογραφίες και οι πίνακες ζωγραφικής, εμπνευσμένοι από την ελληνική μυθολογία. Έτσι τα δωμάτια αυτά φέρουν τα ονόματα όπως Δωμάτιο του Ηρακλή, Σαλόνι της Αφροδίτης κτλ. Στο κέντρο της Αίθουσας των Κατόπτρων βρίσκεται η είσοδος για το πολυτελέστατο υπνοδωμάτιο του βασιλιά, με απερίγραπτο πλούτο. Συμβολίζει το κέντρο της δύναμης του απόλυτου μονάρχη, το κέντρο της χώρας υπό τον Λουδοβίκο ΙΔ\', που είναι ο θεμελιωτής των Βερσαλλιών. Το 1710 ήταν έτοιμη και η Βασιλική Εκκλησία, ενώ το 1770 και η Βασιλική Όπερα. Συνολικά στο παλάτι υπάρχουν 700 δωμάτια.[1] Πριν χτιστεί η Βασιλική εκκλησία του ανακτόρου, διάφοροι χώροι χρησίμευαν ως χώροι για εκκλησιαστική λειτουργία. Έχει δύο ορόφους, στον δεύτερο παρευρισκόταν ο βασιλιάς μαζί με την βασιλική οικογένεια ενώ στο ισόγειο οι ευγενείς της βασιλικής αυλής. Οι τοιχογραφίες σε όλη την εκκλησία έχουν ως κύριο θέμα το Άγιο Πνεύμα, τον Θεό και τον Χριστό.'
                },
                {
                    name: 'Οπερα',
                    url: 'https://media.tacdn.com/media/attractions-splice-spp-674x446/06/e6/af/d3.jpg',
                    text: 'Το κέντρο των Βερσαλλιών είναι η Αίθουσα των Καθρεφτών (ή και Αίθουσα των Κατόπτρων), μήκους 70 μέτρων και είναι στολισμένη με πανάκριβα κρύσταλλα, κεριά και καθρέφτες, τους πιο ακριβούς της εποχής εκείνης. Επίσης στην οροφή και στους τοίχους δεσπόζουν οι τοιχογραφίες και άλλα διάφορα έργα τέχνης από τους καλύτερους ζωγράφους της Ευρώπης εκείνης της εποχής, με ανεκτίμητη αξία. Παράλληλα, δίπλα στην Αίθουσα των Καθρεφτών βρίσκονται τα βασιλικά διαμερίσματα, με μεγαλύτερο αυτό του βασιλιά, που περιλαμβάνει δεκάδες δωμάτια. Κυρίαρχο στοιχείο σε όλα αυτά τα δωμάτια είναι οι τοιχογραφίες και οι πίνακες ζωγραφικής, εμπνευσμένοι από την ελληνική μυθολογία. Έτσι τα δωμάτια αυτά φέρουν τα ονόματα όπως Δωμάτιο του Ηρακλή, Σαλόνι της Αφροδίτης κτλ. Στο κέντρο της Αίθουσας των Κατόπτρων βρίσκεται η είσοδος για το πολυτελέστατο υπνοδωμάτιο του βασιλιά, με απερίγραπτο πλούτο. Συμβολίζει το κέντρο της δύναμης του απόλυτου μονάρχη, το κέντρο της χώρας υπό τον Λουδοβίκο ΙΔ\', που είναι ο θεμελιωτής των Βερσαλλιών. Το 1710 ήταν έτοιμη και η Βασιλική Εκκλησία, ενώ το 1770 και η Βασιλική Όπερα. Συνολικά στο παλάτι υπάρχουν 700 δωμάτια.[1] Πριν χτιστεί η Βασιλική εκκλησία του ανακτόρου, διάφοροι χώροι χρησίμευαν ως χώροι για εκκλησιαστική λειτουργία. Έχει δύο ορόφους, στον δεύτερο παρευρισκόταν ο βασιλιάς μαζί με την βασιλική οικογένεια ενώ στο ισόγειο οι ευγενείς της βασιλικής αυλής. Οι τοιχογραφίες σε όλη την εκκλησία έχουν ως κύριο θέμα το Άγιο Πνεύμα, τον Θεό και τον Χριστό.'
                },
                {
                    name: 'Καστρα',
                    url: 'https://image.freepik.com/free-photo/view-palace-versailles-interiors_1268-3776.jpg',
                    text: 'Το κέντρο των Βερσαλλιών είναι η Αίθουσα των Καθρεφτών (ή και Αίθουσα των Κατόπτρων), μήκους 70 μέτρων και είναι στολισμένη με πανάκριβα κρύσταλλα, κεριά και καθρέφτες, τους πιο ακριβούς της εποχής εκείνης. Επίσης στην οροφή και στους τοίχους δεσπόζουν οι τοιχογραφίες και άλλα διάφορα έργα τέχνης από τους καλύτερους ζωγράφους της Ευρώπης εκείνης της εποχής, με ανεκτίμητη αξία. Παράλληλα, δίπλα στην Αίθουσα των Καθρεφτών βρίσκονται τα βασιλικά διαμερίσματα, με μεγαλύτερο αυτό του βασιλιά, που περιλαμβάνει δεκάδες δωμάτια. Κυρίαρχο στοιχείο σε όλα αυτά τα δωμάτια είναι οι τοιχογραφίες και οι πίνακες ζωγραφικής, εμπνευσμένοι από την ελληνική μυθολογία. Έτσι τα δωμάτια αυτά φέρουν τα ονόματα όπως Δωμάτιο του Ηρακλή, Σαλόνι της Αφροδίτης κτλ. Στο κέντρο της Αίθουσας των Κατόπτρων βρίσκεται η είσοδος για το πολυτελέστατο υπνοδωμάτιο του βασιλιά, με απερίγραπτο πλούτο. Συμβολίζει το κέντρο της δύναμης του απόλυτου μονάρχη, το κέντρο της χώρας υπό τον Λουδοβίκο ΙΔ\', που είναι ο θεμελιωτής των Βερσαλλιών. Το 1710 ήταν έτοιμη και η Βασιλική Εκκλησία, ενώ το 1770 και η Βασιλική Όπερα. Συνολικά στο παλάτι υπάρχουν 700 δωμάτια.[1] Πριν χτιστεί η Βασιλική εκκλησία του ανακτόρου, διάφοροι χώροι χρησίμευαν ως χώροι για εκκλησιαστική λειτουργία. Έχει δύο ορόφους, στον δεύτερο παρευρισκόταν ο βασιλιάς μαζί με την βασιλική οικογένεια ενώ στο ισόγειο οι ευγενείς της βασιλικής αυλής. Οι τοιχογραφίες σε όλη την εκκλησία έχουν ως κύριο θέμα το Άγιο Πνεύμα, τον Θεό και τον Χριστό.'
                }
            ]
        }

    }

    setActivePoint(i){
        console.log(i)
        this.setState({activePoint: i})
    }


    render() {
        return (
            <div className=''>
                <div className='col-12 col-md-8 offset-md-2 mt-6'>
                    <h2 className='display-5'>Τι αξιζει να επισκευθητε;</h2>
                </div>

                <div className="col-12 offset-0 col-md-8 offset-md-2 mt-5 p-0 d-flex mb-5">
                    <div className="col-12 d-flex p-0 flex-wrap">
                        <div className="col-12 col-md-6 mt-3 p-0">
                            {
                                this.state.points.map((point,i)=>{
                                    let additionalClass = ''
                                    let addiotionalTextClass
                                    additionalClass = this.state.activePoint === i ? ' bg-jumbotron' : ''
                                    addiotionalTextClass = this.state.activePoint === i ? ' text-info' : ''

                                    return (
                                        <div onClick={()=>{this.setActivePoint(i)}} className={"col-12 d-flex flex-wrap border-right p-0 m-0 app-pointer app-poi-hover" + additionalClass} key={i}>
                                            <div className="col-4 d-inline p-0">
                                                <img className='img-fluid p-0 m-0' src={point.url} alt=""/>
                                            </div>
                                            <div className="col-8 d-inline">
                                                <h4 className={addiotionalTextClass}>{point.name}</h4>
                                                <p className='d-none d-md-block'>{point.text.substring(0, 180) + '...'}</p>
                                            </div>
                                        </div>
                                    )
                                })
                            }
                        </div>
                        <div className="col-12 col-md-6">
                            <h3 className='text-info app-text-overflow-ellipsis'>{this.state.points[this.state.activePoint].name}</h3>
                            <p>{this.state.points[this.state.activePoint].text}</p>
                        </div>

                    </div>
                </div>
            </div>
        );
    }
}

export default PointsOfInterest;