import React, { Component } from "react"
import Image from "../general/image"
import "../../styles/tours/tour-cities.scss"
import InfoTabs from "../general/info-tabs"

class TourCities extends Component {

  constructor(props) {
    super(props)
    this.state = {
      activeIndex: 0
    }
  }


  render() {
    const cities = [
      {
        name: 'Μπαλι',
        tabInfo: [{"title":"Γενικα","content":[{"title":"","text":"Το Παρίσι (γαλλικά: Paris, ΔΦΑ [paˈʁi]), γνωστό και ως η Πόλη του φωτός (Ville lumière), από τότε που εφοδιάστηκαν οι κύριες λεωφόροι του με φανούς γκαζιού το 1828, είναι η πρωτεύουσα της Γαλλίας και της περιφέρειας Ιλ ντε Φρανς (Île-de-France) και μία από τις ιστορικότερες πόλεις της Ευρώπης. Το Παρίσι περιλαμβάνει την πόλη του Παρισιού και τα περίχωρα και βρίσκεται σε ένα λεκανοπέδιο.","name":"Γενικα"},{"name":"Πληθησμος","text":"Το Παρίσι είναι κτισμένο στο κέντρο του λεκανοπεδίου του Παρισιού, κατά μέσο όρο 65 μέτρα πάνω από τη στάθμη της θάλασσας. Η πόλη του Παρισιού περιβάλλεται από μεγάλα δάση, τα οποία προσφέρουν ανάσα δροσιάς και ανάπαυσης στους Παριζιάνους. Η έκταση της πόλης φτάνει τα 105,4 τετραγωνικά χιλιόμετρα, ενώ ολόκληρη η μητροπολιτική περιοχή ξεπερνά τα 14.518 τετραγωνικά χιλιόμετρα."}]},{"title":"Φαγητο","content":[{"name":"οαερκοεα","text":"ροεακορεακ"}]},{"title":"Πολιτισμος","content":[{"name":"εοακρο","text":"εραοκροαεκ"}]}],
        fileName: 'bali-waterfall.jpg'
      },
      {
        name: 'Ουμπουντ',
        tabInfo: [{"title":"Γενικα","content":[{"title":"","text":"Το Παρίσι (γαλλικά: Paris, ΔΦΑ [paˈʁi]), γνωστό και ως η Πόλη του φωτός (Ville lumière), από τότε που εφοδιάστηκαν οι κύριες λεωφόροι του με φανούς γκαζιού το 1828, είναι η πρωτεύουσα της Γαλλίας και της περιφέρειας Ιλ ντε Φρανς (Île-de-France) και μία από τις ιστορικότερες πόλεις της Ευρώπης. Το Παρίσι περιλαμβάνει την πόλη του Παρισιού και τα περίχωρα και βρίσκεται σε ένα λεκανοπέδιο.","name":"Γενικα"},{"name":"Πληθησμος","text":"Το Παρίσι είναι κτισμένο στο κέντρο του λεκανοπεδίου του Παρισιού, κατά μέσο όρο 65 μέτρα πάνω από τη στάθμη της θάλασσας. Η πόλη του Παρισιού περιβάλλεται από μεγάλα δάση, τα οποία προσφέρουν ανάσα δροσιάς και ανάπαυσης στους Παριζιάνους. Η έκταση της πόλης φτάνει τα 105,4 τετραγωνικά χιλιόμετρα, ενώ ολόκληρη η μητροπολιτική περιοχή ξεπερνά τα 14.518 τετραγωνικά χιλιόμετρα."}]},{"title":"Φαγητο","content":[{"name":"οαερκοεα","text":"ροεακορεακ"}]},{"title":"Πολιτισμος","content":[{"name":"εοακρο","text":"εραοκροαεκ"}]}],
        fileName: 'indonesia-ubud-forrest.jpg'
      },
      {
        name: 'Τζακαρτα',
        tabInfo: [{"title":"Γενικα","content":[{"title":"","text":"Το Παρίσι (γαλλικά: Paris, ΔΦΑ [paˈʁi]), γνωστό και ως η Πόλη του φωτός (Ville lumière), από τότε που εφοδιάστηκαν οι κύριες λεωφόροι του με φανούς γκαζιού το 1828, είναι η πρωτεύουσα της Γαλλίας και της περιφέρειας Ιλ ντε Φρανς (Île-de-France) και μία από τις ιστορικότερες πόλεις της Ευρώπης. Το Παρίσι περιλαμβάνει την πόλη του Παρισιού και τα περίχωρα και βρίσκεται σε ένα λεκανοπέδιο.","name":"Γενικα"},{"name":"Πληθησμος","text":"Το Παρίσι είναι κτισμένο στο κέντρο του λεκανοπεδίου του Παρισιού, κατά μέσο όρο 65 μέτρα πάνω από τη στάθμη της θάλασσας. Η πόλη του Παρισιού περιβάλλεται από μεγάλα δάση, τα οποία προσφέρουν ανάσα δροσιάς και ανάπαυσης στους Παριζιάνους. Η έκταση της πόλης φτάνει τα 105,4 τετραγωνικά χιλιόμετρα, ενώ ολόκληρη η μητροπολιτική περιοχή ξεπερνά τα 14.518 τετραγωνικά χιλιόμετρα."}]},{"title":"Φαγητο","content":[{"name":"οαερκοεα","text":"ροεακορεακ"}]},{"title":"Πολιτισμος","content":[{"name":"εοακρο","text":"εραοκροαεκ"}]}],
        fileName: 'indonesia-jakarta-center-2.jpg'
      }
    ]


    return (
      <div className='d-flex flex-wrap col-12 col-lg-8 offset-lg-2 my-5 p-0 tour-cities-wrap'>
        {
          cities.map((city)=>{

            return (
              <div className="d-flex flex-wrap tour-cities col-12 p-0">
                <div className="col-12 col-lg-6 p-0 text-left tour-cities-image">
                  <Image className='tour-cities-img p-0 m-0 img-fluid' fileName={city.fileName} alt={''} />
                </div>
                <div className="col-12 col-lg-6 tour-cities tour-cities-info">
                  <h4 className='display-5 m-0 mb-3 tour-city-title'>{city.name}</h4>
                  <InfoTabs className='tour-cities-tabs' tabInfo={city.tabInfo}/>
                </div>
              </div>
            )
          })
        }
      </div>
    )
  }
}

export default TourCities