import React, {Component} from 'react';
import ImageHeader from "../image-headers/image-header";
import eiffel from '../../assets/images/city/eiffel-tower-951509.jpg'
import TourImageHeader from "../image-headers/tour-image-header";
import {FaCalendarDay, FaClock, FaMapMarkerAlt} from "react-icons/fa";

class Tour extends Component {
    render() {
        return (
            <div>
                <TourImageHeader  title={'Ταξιδι για οικογενεια 4ων'} subtitle={'Μαγικο παρισι'} imageUrl={eiffel}  />



                <div className="d-flex my-6 flex-wrap">
                    <div className="col-8 offset-2 col-md-6">
                        <h3 className='display-6'>Το ταξιδι με μια ματια</h3>
                        <p>Το πρόγραμμα-προπύργιο της «άλλης» Ευρώπης του Versus Travel. Ένα υπέροχο ταξίδι, σχεδιασμένο όπως πρέπει να είναι μια ολοκληρωμένη επίσκεψη σε μια περιοχή, με γεμάτες ημέρες, χωρίς προαιρετικές εκδρομές, με διαμονή σε ιστορικές πόλεις και έμφαση στην ιστορία και τον πολιτισμό. Από τους κοσμοπολίτικους προορισμούς Μόντε Κάρλο και Κάννες μέχρι τη Νιμ. Ένα ταξίδι-ορισμός του πληθωρικού, σχεδιασμένο ειδικά για τους ταξιδιώτες που ακόμα και στην Ευρώπη θέλουν τα ταξίδια τους «εξερευνητικά». Η διαμονή στην καρδιά της Νιμ, δίπλα στη Ρωμαϊκή Αρένα, η διαμονή στις Κάννες δίπλα στην Κρουαζέτ είναι επιπλέον στοιχεία ενός ευρηματικά προγραμματισμένου ταξιδιού, που ξεφεύγει από τις εύκολες λύσεις – διαμονή δηλαδή σε μια πόλη-κέντρο και από εκεί κουραστικές ημερήσιες εκδρομές και με τα πάντα προαιρετικά. Το πρόγραμμα-προπύργιο της «άλλης» Ευρώπης του Versus Travel. Ένα υπέροχο ταξίδι, σχεδιασμένο όπως πρέπει να είναι μια ολοκληρωμένη επίσκεψη σε μια περιοχή, με γεμάτες ημέρες, χωρίς προαιρετικές εκδρομές, με διαμονή σε ιστορικές πόλεις και έμφαση στην ιστορία και τον πολιτισμό. Από τους κοσμοπολίτικους προορισμούς Μόντε Κάρλο και Κάννες μέχρι τη Νιμ. Ένα ταξίδι-ορισμός του πληθωρικού, σχεδιασμένο ειδικά για τους ταξιδιώτες που ακόμα και στην Ευρώπη θέλουν τα ταξίδια τους «εξερευνητικά».</p>
                    </div>

                    <div className='bg-jumbotron col-8 offset-2 col-md-2 offset-md-0'>
                        <div className="text-center display-7 mt-3">Σημαντικες Πληροφοριες</div>
                        <div>
                            <div className='mt-3'>
                                <div>
                                    <FaCalendarDay /> <b>Αναχωρήσεις</b>
                                </div>
                                <div>
                                    30/6, 5/7, 19/7, 20/7,  30/6, 5/7, 19/7, 20/7, 30/6, 5/7, 19/7, 20/7
                                </div>
                            </div>
                            <div className='mt-3'>
                                <div>
                                    <FaClock /> <b>Διαρκεια</b>
                                </div>
                                <div>
                                    6 Μέρες / 7 Νύχτες
                                </div>
                            </div>

                            <div className='mt-3'>
                                <div>
                                    <FaMapMarkerAlt /> <b>Αναχώρηση από</b>
                                </div>
                                <div>
                                    Αθήνα/ Ηράκλειο/ Χανία
                                </div>
                            </div>
                        </div>
                    </div>
                </div>

            </div>

        );
    }
}

export default Tour;